# SQLite

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#SQLite" data-toc-modified-id="SQLite-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>SQLite</a></span><ul class="toc-item"><li><span><a href="#Création-de-la-base" data-toc-modified-id="Création-de-la-base-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Création de la base</a></span></li><li><span><a href="#Création-de-la-table-et-des-champs" data-toc-modified-id="Création-de-la-table-et-des-champs-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Création de la table et des champs</a></span></li><li><span><a href="#Ajout-de-données-à-la-table" data-toc-modified-id="Ajout-de-données-à-la-table-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Ajout de données à la table</a></span></li><li><span><a href="#Requêtes" data-toc-modified-id="Requêtes-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Requêtes</a></span><ul class="toc-item"><li><span><a href="#Liste-des-tables-dans-une-base-de-données" data-toc-modified-id="Liste-des-tables-dans-une-base-de-données-1.4.1"><span class="toc-item-num">1.4.1&nbsp;&nbsp;</span>Liste des tables dans une base de données</a></span></li><li><span><a href="#Liste-des-colonnes" data-toc-modified-id="Liste-des-colonnes-1.4.2"><span class="toc-item-num">1.4.2&nbsp;&nbsp;</span>Liste des colonnes</a></span></li><li><span><a href="#Nb-de-lignes" data-toc-modified-id="Nb-de-lignes-1.4.3"><span class="toc-item-num">1.4.3&nbsp;&nbsp;</span>Nb de lignes</a></span></li></ul></li><li><span><a href="#Avec-Pandas" data-toc-modified-id="Avec-Pandas-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Avec Pandas</a></span></li></ul></li></ul></div>

In [1]:
%load_ext sql

## Création de la base

* Nom de la base : flask.db3
* Chemin : /data

In [3]:
%sql sqlite:///data/flask.db3

'Connected: @data/flask.db3'

## Création de la table et des champs
* Table : users
* Nom des champs :
    * id
    * nom
    * prenom
    * sexe
    * pseudo

In [7]:
%%sql sqlite://
CREATE TABLE users(
    ID int  NOT NULL UNIQUE,
    PRIMARY KEY (ID),
    Prenom VARCHAR(50) NOT NULL,
    Nom VARCHAR(50) NOT NULL,  
    Pseudo VARCHAR(50) NOT NULL,
    Sexe VARCHAR(5) NOT NULL,
);

(sqlite3.OperationalError) table users already exists
[SQL: CREATE TABLE users(
    ID int  NOT NULL UNIQUE,
    PRIMARY KEY (ID),
    Prenom VARCHAR(50) NOT NULL,
    Nom VARCHAR(50) NOT NULL,
    Pseudo VARCHAR(50) NOT NULL,
    Sexe VARCHAR(5) NOT NULL,
);]
(Background on this error at: http://sqlalche.me/e/e3q8)

TODO : changer Sexe en booléen

## Ajout de données à la table

In [9]:
%%sql sqlite://
INSERT INTO users VALUES (1, 'William', 'Shakespeare', 'willi', 'M');
INSERT INTO users VALUES (2, 'Meidi', 'Cament', 'Med', 'M');
INSERT INTO users VALUES (3, 'jean', 'Bon', 'JJ', 'M');

1 rows affected.
1 rows affected.
1 rows affected.

[]

## Requêtes

In [10]:
sqlres = %sql SELECT * from users
sqlres

 * sqlite:///data/flask.db3
Done.

[(1, 'William', 'Shakespeare', 'willi', 'M'),
 (2, 'Meidi', 'Cament', 'Med', 'M'),
 (3, 'jean', 'Bon', 'JJ', 'M')]

In [11]:
sqlres = %sql SELECT Prenom, Nom from users
sqlres

 * sqlite:///data/flask.db3
Done.

[('William', 'Shakespeare'), ('Meidi', 'Cament'), ('jean', 'Bon')]

### Liste des tables dans une base de données

In [12]:
%sql SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///data/flask.db3
Done.

[('users',)]

### Liste des colonnes

In [14]:
%sql select * from users where 1=0

 * sqlite:///data/flask.db3
Done.

[]

In [15]:
%sql select * from users LIMIT 0

 * sqlite:///data/flask.db3
Done.

[]

In [16]:
%sql select * from users LIMIT 2

 * sqlite:///data/flask.db3
Done.

[(1, 'William', 'Shakespeare', 'willi', 'M'),
 (2, 'Meidi', 'Cament', 'Med', 'M')]

! la commande ci-dessous renvoie tout le contenu (donc faire attention à la taille avnt de lancer la commande)

In [17]:
%sql select * from users

 * sqlite:///data/flask.db3
Done.

[(1, 'William', 'Shakespeare', 'willi', 'M'),
 (2, 'Meidi', 'Cament', 'Med', 'M'),
 (3, 'jean', 'Bon', 'JJ', 'M')]

### Nb de lignes

In [18]:
%sql SELECT COUNT(*) as nrow From users

 * sqlite:///data/flask.db3
Done.

[(3,)]

In [19]:
%sql SELECT Prenom, Nom From users WHERE pseudo='JJ'

 * sqlite:///data/flask.db3
Done.

[('jean', 'Bon')]

## Avec Pandas

In [20]:
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib

%matplotlib inline

In [21]:
%%sql sqlres << 
SELECT Prenom, Nom, Sexe, Pseudo, 
FROM users

 * sqlite:///data/flask.db3
(sqlite3.OperationalError) near "FROM": syntax error
[SQL: SELECT Prenom, Nom, Sexe, Pseudo, FROM users]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [22]:
df = sqlres.DataFrame()
df.head()

    Prenom          Nom
0  William  Shakespeare
1    Meidi       Cament
2     jean          Bon

https://www.javatpoint.com/flask-sqlite